import nltk as nlp
import re
x=0

for y in range(1,301):
    output=""
    print(y)
    filename="C-"+str(y)+".xml"
    file=open(filename,"r+",encoding="utf8")
    text=file.read()
    find= re.finditer(r'([\w]{3}, [\d]{2} [\w]{3} [\d]{4} [\d]{2}:[\d]{2} [\w]{2} (.....))', text) 
    for i in find:
        replace= re.sub(r'([\w]{3}, [\d]{2} [\w]{3} [\d]{4} [\d]{2}:[\d]{2} [\w]{2} (.....))', r'<T>\1</T>', text) 
        #print(i.group())
        #print(i)
        output+= i.group() +"\n"
        x=x+1
    find2= re.finditer(r'(((अगले|पिछले|पहले) (महीने|साल|दिन|दिनों|कुछ) (जून|सोमवार|समय|शाम|पूर्व))|गर्मियों|आजकल|आने वाले वर्षों|((रविवार|सोमवार|मंगलवार|बुधवार|गुरुवार|शुक्रवार|शनिवार|रात) (रात|करीब) \d+ बजे)|(रविवार|सोमवार|मंगलवार|बुधवार|गुरुवार|शुक्रवार|शनिवार|देर) (दिन भर|शाम|रात)|(रविवार|सोमवार|मंगलवार|बुधवार|गुरुवार|शुक्रवार|शनिवार)|((महीने|साल|दिन|दिनों) भर| रोज )|(लंबे समय|समय )|दीपावली|दिवाली|महिला दिवस|(\d+/\d+(/\d+|))|सुबह |शाम )', text) 
    for k in find2:
        #print(k)
        #print(k.group())
        output+= k.group() + "\n"
        x=x+1
    find3= re.finditer(r'(((अगले|पिछले|कई) (\d+|छह से सात|तीन) (महीने|सालों|साल))|((\d+|छह|एक|दो|तीन|चार|पांच|सात|आठ|नौ|दस|ग्यारह|बारह|बीस|कुछ|कई) (सप्ताह|महीने|साल|दिनों|दिन|घंटे|के) (पहले|आगे|बाद))|(अगले|पिछले|पहले|डेढ़|चंद|इन|कुछ|हर|आनेवाले|कई|प्रति|ढाई) (महीना|महीने|सालों|साल|दिनों|दिन |दशक|ही मिनटों|मिनट|घंटे|हफ्ते)|12.11 बजे|नंबर-\d+|रात \d+ से \d+ बजे|(\d+- \d+ (वर्ष|सितंबर))|((चार|एक) से (पांच|तीन) (मिनट|घंटे))|(((\d+ से \d+)|\d+|छह|एक|दो|तीन|चार|पांच|सात|आठ|नौ|दस|ग्यारह|बारह|काफी) (माह|वर्ष |महीने|सालों|साल|दिन |घंटों|दिनों|घंटा |घंटे|समय|दशक|मिनट|सितंबर|के बाद))|((\d+|) (जनवरी|फरवरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितंबर|अक्टूबर|नवंबर|दिसंबर) \d+)|(\d+ (जनवरी|दिसंबर) से शुरू होकर \d+ जनवरी)|(\d+ से \d+ (जनवरी|फरवरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितंबर|अक्टूबर|नवंबर|दिसंबर|दिनों|दिन))|(\d+ (जनवरी|फरवरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितंबर|अक्टूबर|नवंबर|दिसंबर) से \d+ (जनवरी|फरवरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितंबर|अक्टूबर|नवंबर|दिसंबर))|(साल \d+ से लेकर साल \d+ (जनवरी|फरवरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितंबर|अक्टूबर|नवंबर|दिसंबर|))|(वर्ष|साल|जुलाई - अगस्त|जुलाई) [\d]{4}|((\d+|) (जनवरी|फरवरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितंबर|अक्टूबर|नवंबर|दिसंबर))|((वर्ष|साल ) \d+ से (वर्ष|साल) \d+)|(साल \d+ से \d+)|([\d]{4} से[\d]{4}| [\d]{4} |जुलाई|\d+ (दिनों|दिन)|वर्षों |(इस|इसी) साल| आज )| सालों |साल |दशहरा|(मकर संक्रांति|पोंगल|वसंत पंचमी|महा शिवरात्रि|तमिल नव वर्ष|गुडी पड़वा|रामनवमी|वैसाखी|अक्षय तृतीया|सावित्री पूजा|रथ यात्रा|गुरु पूर्णिमा|नाग पंचमी|रक्षा-बंधन|कृष्ण जन्माष्टमी|गणेश चतुर्थी|अनंत चतुर्दशी|तीज|विश्वकर्मा पूजा|ओणम |नवरात्रि |लक्ष्मी पूजा|धनतेरस|कार्तिक पूर्णिमा|कार्व चौथ|छठ|भाई दूज|महावीर जयंती|पर्युषण|ईद मिलादुन्नबी|हजरत अली का जन्मदिन|शबे बरात|जमात उल विदा|ईद-उल-फित्र|ईद-उल-ज़ुहा|मुहर्रम|गुरु गोविंद सिंह जयंती|लोहड़ी|होला मोहल्ला|गुरू राम दास जी का जन्मदिन|गुरु नानक जयंती|गुरपूरब|महावीर जयंती|गुड फ़्राइडे|ईस्टर|क्रिसमस|ईद ))', text) 
    for j in find3:
        replace2= re.sub(r'(((अगले|पिछले|कई) (\d+|छह से सात|तीन) (महीने|सालों|साल))|((\d+|छह|एक|दो|तीन|चार|पांच|सात|आठ|नौ|दस|ग्यारह|बारह|बीस|कुछ|कई) (सप्ताह|महीने|साल|दिनों|दिन|घंटे|के) (पहले|आगे|बाद))|(\d+- \d+ (वर्ष|सितंबर))|(((\d+ से \d+)|\d+|छह|एक|दो|तीन|चार|पांच|सात|आठ|नौ|दस|ग्यारह|बारह|काफी) (माह|वर्ष |महीने|सालों|घंटों |साल|दिन |दिनों|घंटे|समय|दशक|घंटा|मिनट|सितंबर|के बाद))|12.11 बजे|नंबर-\d+|रात \d+ से \d+ बजे|((\d+|) (जनवरी|फरवरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितंबर|अक्टूबर|नवंबर|दिसंबर) \d+)|(\d+ (जनवरी|दिसंबर) से शुरू होकर \d+ जनवरी)|(\d+ (जनवरी|फरवरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितंबर|अक्टूबर|नवंबर|दिसंबर) से \d+ (जनवरी|फरवरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितंबर|अक्टूबर|नवंबर|दिसंबर)|(साल \d+ से लेकर साल \d+ (जनवरी|फरवरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितंबर|अक्टूबर|नवंबर|दिसंबर|))|(वर्ष|साल|जुलाई - अगस्त|जुलाई) \d+ |((\d+|) (जनवरी|फरवरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितंबर|अक्टूबर|नवंबर|दिसंबर))|((वर्ष|साल) \d+ से (वर्ष|साल) \d+)|(साल \d+ से \d+)|((इन|चंद|\d+) (दिनों|दिन)|(इस|इसी) साल|वर्षों| आज |जुलाई|रोज |गर्मियों)|((रविवार|सोमवार|मंगलवार|बुधवार|गुरुवार|शुक्रवार|शनिवार|रात) (रात|करीब) \d+ बजे)|((रविवार|सोमवार|मंगलवार|बुधवार|गुरुवार|शुक्रवार|शनिवार|देर) (दिन भर|शाम |रात))|(रविवार|सोमवार|मंगलवार|बुधवार|गुरुवार|शुक्रवार|शनिवार)|((अगले|पिछले|पहले) (महीने|साल|दिन|दिनों|कुछ) (सोमवार|जून|समय|शाम |पूर्व))|(लंबे समय|समय)|(अगले|पिछले|पहले|डेढ़|कुछ|हर|आनेवाले|कई|प्रति|ढाई) (महीना|महीने|सालों|साल|दिन|दिनों|दशक|ही मिनटों|मिनट|घंटे|हफ्ते)|((महीने|साल|दिन|दिनों) भर))| सालों |साल |(\d+ से \d+ (जनवरी|फरवरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितंबर|अक्टूबर|नवंबर|दिसंबर|दिनों|दिन))|[\d]{4} से [\d]{4}| [\d]{4} |सुबह |शाम |दशहरा |आने वाले वर्षों|आजकल|दीपावली|दिवाली|महिला दिवस|(\d+/\d+(/\d+|))|((चार|एक) से (पांच|तीन) (मिनट|घंटे))|(मकर संक्रांति|पोंगल|वसंत पंचमी|महा शिवरात्रि|तमिल नव वर्ष|गुडी पड़वा|रामनवमी|वैसाखी|अक्षय तृतीया|सावित्री पूजा|रथ यात्रा|गुरु पूर्णिमा|नाग पंचमी|रक्षा-बंधन|कृष्ण जन्माष्टमी|गणेश चतुर्थी|अनंत चतुर्दशी|तीज|विश्वकर्मा पूजा|ओणम |नवरात्रि |लक्ष्मी पूजा|धनतेरस|कार्तिक पूर्णिमा|कार्व चौथ|छठ|भाई दूज|महावीर जयंती|पर्युषण|ईद मिलादुन्नबी|हजरत अली का जन्मदिन|शबे बरात|जमात उल विदा|ईद-उल-फित्र|ईद-उल-ज़ुहा|मुहर्रम|गुरु गोविंद सिंह जयंती|लोहड़ी|होला मोहल्ला|गुरू राम दास जी का जन्मदिन|गुरु नानक जयंती|ईद |गुरपूरब|महावीर जयंती|गुड फ़्राइडे|ईस्टर|क्रिसमस))', r'<T>\1</T>', text) 
        #print(j.group())
        output+= j.group() + "\n"
        x=x+1
    file= open("Log-"+str(y)+".txt","w+",encoding="utf8")
    print(output)
    file.write(output)
    file.close()
    print(replace2)
print(x)
